skortela/esp8266_p1meter_sv/src/main.cpp
#include <FS.h>
#include <EEPROM.h>
#include <DNSServer.h>
#include <ESP8266WiFi.h>
#include <Ticker.h>
#include <WiFiManager.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <PubSubClient.h>
//#include <SoftwareSerial.h>

// * Include settings
#include "settings.h"
#include "telegram.h"

// * Initiate led blinker library
Ticker ticker;

// * Initiate WIFI client
WiFiClient espClient;

// * Initiate MQTT client
PubSubClient mqtt_client(espClient);

// * MQTT Last reconnection counter
unsigned long LAST_RECONNECT_ATTEMPT = 0;

unsigned long LAST_UPDATE_SENT = 0;

// * To be filled with EEPROM data
char MQTT_HOST[64] = "";
char MQTT_PORT[6]  = "";
char MQTT_USER[32] = "";
char MQTT_PASS[32] = "";

// * Set to store received telegram
char telegram[P1_MAXLINELENGTH];

#ifdef SEND_AS_JSON
char telegramJson[P1_MAXJSONLENGTH];
int jsonPos=0;
#endif


Telegram lastSendMsg;
Telegram currentMsg;

// * Set during CRC checking
unsigned int currentCRC = 0;

void tick();
void processLine(int len);

// **********************************
// * WIFI                           *
// **********************************

// * Gets called when WiFiManager enters configuration mode
void configModeCallback(WiFiManager *myWiFiManager)
{
    Serial.println(F("Entered config mode"));
    Serial.println(WiFi.softAPIP());

    // * If you used auto generated SSID, print it
    Serial.println(myWiFiManager->getConfigPortalSSID());

    // * Entered config mode, make led toggle faster
    ticker.attach(0.2, tick);
}

// **********************************
// * Ticker (System LED Blinker)    *
// **********************************

// * Blink on-board Led
void tick()
{
    // * Toggle state
    int state = digitalRead(LED_BUILTIN);    // * Get the current state of GPIO1 pin
    digitalWrite(LED_BUILTIN, !state);       // * Set pin to the opposite state
}

// **********************************
// * MQTT                           *
// **********************************

// * Send a message to a broker topic
void send_mqtt_message(const char *topic, char *payload)
{
    Serial.printf("MQTT Outgoing on %s: ", topic);
    Serial.println(payload);

    bool result = mqtt_client.publish(topic, payload, false);

    if (!result)
    {
        Serial.printf("MQTT publish to topic %s failed\n", topic);
    }
}

// * Reconnect to MQTT server and subscribe to in and out topics
bool mqtt_reconnect()
{
    // * Loop until we're reconnected
    int MQTT_RECONNECT_RETRIES = 0;

    while (!mqtt_client.connected() && MQTT_RECONNECT_RETRIES < MQTT_MAX_RECONNECT_TRIES)
    {
        MQTT_RECONNECT_RETRIES++;
        Serial.printf("MQTT connection attempt %d / %d ...\n", MQTT_RECONNECT_RETRIES, MQTT_MAX_RECONNECT_TRIES);

        String clientId = HOSTNAME;
        clientId += WiFi.macAddress();

        String availability = String(MQTT_ROOT_TOPIC) + String("/availability");

        // * Attempt to connect
        if (mqtt_client.connect(clientId.c_str(), MQTT_USER, MQTT_PASS, availability.c_str() , MQTTQOS0, true, "offline"))
        {
            Serial.println(F("MQTT connected!"));

            // * Once connected, publish an announcement...
            mqtt_client.publish(availability.c_str(), "online", true);

            Serial.printf("MQTT root topic: %s\n", MQTT_ROOT_TOPIC);
        }
        else
        {
            Serial.print(F("MQTT Connection failed: rc="));
            Serial.println(mqtt_client.state());
            Serial.println(F(" Retrying in 5 seconds"));
            Serial.println("");

            // * Wait 5 seconds before retrying
            delay(5000);
        }
    }

    if (MQTT_RECONNECT_RETRIES >= MQTT_MAX_RECONNECT_TRIES)
    {
        Serial.printf("*** MQTT connection failed, giving up after %d tries ...\n", MQTT_RECONNECT_RETRIES);
        return false;
    }

    return true;
}

void send_metric(String name, double metric)
{
    Serial.print(F("Sending metric to broker: "));
    Serial.print(name);
    Serial.print(F("="));
    Serial.println(metric);

    char output[20];
    dtostrf(metric, 1, 3, output); // Convert double to string with 3 decimal places

    String topic = String(MQTT_ROOT_TOPIC) + "/" + name;
    send_mqtt_message(topic.c_str(), output);
}

void send_data_to_broker()
{
#ifdef SEND_AS_JSON
    String topic = String(MQTT_ROOT_TOPIC) + "/state";
    send_mqtt_message(topic.c_str(), telegramJson);
#else
    bool forceSend = LAST_UPDATE_SENT == 0 || (unsigned long)(millis() - LAST_UPDATE_SENT) > UPDATE_INTERVAL;
    if (forceSend) {
        send_metric("consumption", currentMsg.CONSUMPTION);
    }
    if (forceSend) {
        send_metric("returndelivery", currentMsg.RETURNDELIVERY);
    }
    if (forceSend) {
        send_metric("consumption_reactive", currentMsg.CONSUMPTION_REACT);
    }
    if (forceSend) {
        send_metric("returndelivery_reactive", currentMsg.RETURNDELIVERY_REACT);
    }
    if (forceSend || abs(lastSendMsg.ACTUAL_CONSUMPTION - currentMsg.ACTUAL_CONSUMPTION) > 0.005 ) {
        send_metric("actual_consumption", currentMsg.ACTUAL_CONSUMPTION);
    }
    if (forceSend || abs(lastSendMsg.ACTUAL_RETURNDELIVERY - currentMsg.ACTUAL_RETURNDELIVERY) > 0.005 ) {
        send_metric("actual_returndelivery", currentMsg.ACTUAL_RETURNDELIVERY);
    }
    if (forceSend || abs(lastSendMsg.ACTUAL_CONSUMPTION_REACT - currentMsg.ACTUAL_CONSUMPTION_REACT) > 0.005) {
        send_metric("actual_consumption_reactive", currentMsg.ACTUAL_CONSUMPTION_REACT);
    }
    if (forceSend || abs(lastSendMsg.ACTUAL_RETURNDELIVERY_REACT - currentMsg.ACTUAL_RETURNDELIVERY_REACT) > 0.005) {
        send_metric("actual_returndelivery_reactive", currentMsg.ACTUAL_RETURNDELIVERY_REACT);
    }

    if (forceSend || abs(lastSendMsg.L1_INSTANT_POWER_USAGE - currentMsg.L1_INSTANT_POWER_USAGE) > 0.005) {
        send_metric("l1_instant_power_usage", currentMsg.L1_INSTANT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L1_INSTANT_POWER_DELIVERY - currentMsg.L1_INSTANT_POWER_DELIVERY) > 0.005) {
        send_metric("l1_instant_power_delivery", currentMsg.L1_INSTANT_POWER_DELIVERY);
    }
    if (forceSend || abs(lastSendMsg.L2_INSTANT_POWER_USAGE - currentMsg.L2_INSTANT_POWER_USAGE) > 0.005) {
        send_metric("l2_instant_power_usage", currentMsg.L2_INSTANT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L2_INSTANT_POWER_DELIVERY - currentMsg.L2_INSTANT_POWER_DELIVERY) > 0.005) {
        send_metric("l2_instant_power_delivery", currentMsg.L2_INSTANT_POWER_DELIVERY);
    }
    if (forceSend || abs(lastSendMsg.L3_INSTANT_POWER_USAGE - currentMsg.L3_INSTANT_POWER_USAGE) > 0.005) {
        send_metric("l3_instant_power_usage", currentMsg.L3_INSTANT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L3_INSTANT_POWER_DELIVERY - currentMsg.L3_INSTANT_POWER_DELIVERY) > 0.005) {
        send_metric("l3_instant_power_delivery", currentMsg.L3_INSTANT_POWER_DELIVERY);
    }

    if (forceSend || abs(lastSendMsg.L1_REACT_POWER_USAGE - currentMsg.L1_REACT_POWER_USAGE) > 0.005) {
        send_metric("l1_reactive_power_usage", currentMsg.L1_REACT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L1_REACT_POWER_DELIVERY - currentMsg.L1_REACT_POWER_DELIVERY) > 0.005) {
        send_metric("l1_reactive_power_delivery", currentMsg.L1_REACT_POWER_DELIVERY);
    }
    if (forceSend || abs(lastSendMsg.L2_REACT_POWER_USAGE - currentMsg.L2_REACT_POWER_USAGE) > 0.005) {
        send_metric("l2_reactive_power_usage", currentMsg.L2_REACT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L2_REACT_POWER_DELIVERY - currentMsg.L2_REACT_POWER_DELIVERY) > 0.005) {
        send_metric("l2_reactive_power_delivery", currentMsg.L2_REACT_POWER_DELIVERY);
    }
    if (forceSend || abs(lastSendMsg.L3_REACT_POWER_USAGE - currentMsg.L3_REACT_POWER_USAGE) > 0.005) {
        send_metric("l3_reactive_power_usage", currentMsg.L3_REACT_POWER_USAGE);
    }
    if (forceSend || abs(lastSendMsg.L3_REACT_POWER_DELIVERY - currentMsg.L3_REACT_POWER_DELIVERY) > 0.005) {
        send_metric("l3_reactive_power_delivery", currentMsg.L3_REACT_POWER_DELIVERY);
    }

    if (forceSend || abs(lastSendMsg.L1_VOLTAGE - currentMsg.L1_VOLTAGE) > 5) {
        send_metric("l1_voltage", currentMsg.L1_VOLTAGE);
    }
    if (forceSend || abs(lastSendMsg.L2_VOLTAGE - currentMsg.L2_VOLTAGE) > 5) {
        send_metric("l2_voltage", currentMsg.L2_VOLTAGE);
    }
    if (forceSend || abs(lastSendMsg.L3_VOLTAGE - currentMsg.L3_VOLTAGE) > 5) {
        send_metric("l3_voltage", currentMsg.L3_VOLTAGE);
    }

    if (forceSend || abs(lastSendMsg.L1_INSTANT_POWER_CURRENT - currentMsg.L1_INSTANT_POWER_CURRENT) > 0.005) {
        send_metric("l1_instant_power_current", currentMsg.L1_INSTANT_POWER_CURRENT);
    }
    if (forceSend || abs(lastSendMsg.L2_INSTANT_POWER_CURRENT - currentMsg.L2_INSTANT_POWER_CURRENT) > 0.005) {
        send_metric("l2_instant_power_current", currentMsg.L2_INSTANT_POWER_CURRENT);
    }
    if (forceSend || abs(lastSendMsg.L3_INSTANT_POWER_CURRENT - currentMsg.L3_INSTANT_POWER_CURRENT) > 0.005) {
        send_metric("l3_instant_power_current", currentMsg.L3_INSTANT_POWER_CURRENT);
    }
    send_metric("RSSI", WiFi.RSSI());
    
    lastSendMsg = currentMsg;
    if (forceSend) {
        LAST_UPDATE_SENT = millis();
    }
#endif
    
