skortela/esp8266_p1meter_sv/src/main.cpp
}

// **********************************
// * P1                             *
// **********************************

unsigned int CRC16(unsigned int crc, unsigned char *buf, int len)
{
	for (int pos = 0; pos < len; pos++)
    {
		crc ^= (unsigned int)buf[pos];    // * XOR byte into least sig. byte of crc
                                          // * Loop over each bit
        for (int i = 8; i != 0; i--)
        {
            // * If the LSB is set
            if ((crc & 0x0001) != 0)
            {
                // * Shift right and XOR 0xA001
                crc >>= 1;
				crc ^= 0xA001;
			}
            // * Else LSB is not set
            else
                // * Just shift right
                crc >>= 1;
		}
	}
	return crc;
}

bool isNumber(char *res, int len)
{
    for (int i = 0; i < len; i++)
    {
        if (((res[i] < '0') || (res[i] > '9')) && (res[i] != '.' && res[i] != 0))
            return false;
    }
    return true;
}

int FindCharInArrayRev(char array[], char c, int len)
{
    for (int i = len - 1; i >= 0; i--)
    {
        if (array[i] == c)
            return i;
    }
    return -1;
}

double getValue(char *buffer, int maxlen, char startchar, char endchar)
{
    int s = FindCharInArrayRev(buffer, startchar, maxlen - 2);
    int l = FindCharInArrayRev(buffer, endchar, maxlen - 2) - s - 1;

    char res[16];
    memset(res, 0, sizeof(res));

    if (strncpy(res, buffer + s + 1, l))
    {
        if (endchar == '*')
        {
            if (isNumber(res, l))
                return (atof(res));
        }
        else if (endchar == ')')
        {
            if (isNumber(res, l))
                return atof(res);
        }
    }
    
    return 0;
}

void addJson(const char* field, double value) {
#ifdef SEND_AS_JSON
    // Add comma if jsonPos > 2
    if (jsonPos > 2) {
        telegramJson[jsonPos++] = ','; // Add comma and update jsonPos
    }

    // Add {"field": "value"} to telegramJson buffer
    int bytesWritten = snprintf(telegramJson + jsonPos, P1_MAXJSONLENGTH - jsonPos, "\"%s\": %.3f", field, value);

    // Update jsonPos with the number of bytes written
    if (bytesWritten >= 0 && bytesWritten < P1_MAXJSONLENGTH - jsonPos) {
        jsonPos += bytesWritten;
    }
#endif
}
// parsing of telegram according to Swedish ESMR 5.0 implementation //UKR 1220
bool decode_telegram(int len)
{
    int startChar = FindCharInArrayRev(telegram, '/', len);
    int endChar = FindCharInArrayRev(telegram, '!', len);
    bool validCRCFound = false;

    for (int cnt = 0; cnt < len; cnt++) {
        Serial.print(telegram[cnt]);
    }
    Serial.print("\n");

    if (startChar >= 0)
    {
        // * Start found. Reset CRC calculation
        currentCRC = CRC16(0x0000,(unsigned char *) telegram+startChar, len-startChar);
#ifdef SEND_AS_JSON
        strcpy(telegramJson, "{");
        jsonPos = strlen(telegramJson);
#endif
    }
    else if (endChar >= 0)
    {
        // * Add to crc calc
        currentCRC = CRC16(currentCRC,(unsigned char*)telegram+endChar, 1);

        char messageCRC[5];
        strncpy(messageCRC, telegram + endChar + 1, 4);

        messageCRC[4] = 0;   // * Thanks to HarmOtten (issue 5)
        validCRCFound = (strtol(messageCRC, NULL, 16) == currentCRC);

        if (validCRCFound)
            Serial.println(F("CRC Valid!"));
        else
            Serial.println(F("CRC Invalid!"));

        currentCRC = 0;
#ifdef SEND_AS_JSON
        strcpy(telegramJson + jsonPos, "}");
        jsonPos = strlen(telegramJson);
#endif
    }
    else
    {
        currentCRC = CRC16(currentCRC, (unsigned char*) telegram, len);
    }

    // 1-0:1.8.0(000992.992*kWh)
    // 1-0:1.8.0 = Cumulative hourly active import energy (A+) (Q1+Q4)
    if (strncmp(telegram, "1-0:1.8.0", 9) == 0)
    {
        currentMsg.CONSUMPTION = getValue(telegram, len, '(', '*');
        addJson("consumption", currentMsg.CONSUMPTION);
    }

    // 1-0:2.8.0(000560.157*kWh)
    // 1-0:2.8.0 = Cumulative hourly active export energy (A-) (Q2+Q3)
    if (strncmp(telegram, "1-0:2.8.0", 9) == 0)
    {
        currentMsg.RETURNDELIVERY = getValue(telegram, len, '(', '*');
        addJson("returndelivery", currentMsg.RETURNDELIVERY);
    }

    // 1-0:3.8.0(000560.157*kWh)
    // 1-0:3.8.0 = Cumulative hourly reactive import energy (R+) (Q1+Q2)
    if (strncmp(telegram, "1-0:3.8.0", 9) == 0)
    {
        currentMsg.CONSUMPTION_REACT = getValue(telegram, len, '(', '*');
        addJson("consumption_reactive", currentMsg.CONSUMPTION_REACT);
    }

    // 1-0:4.8.0(000560.157*kWh)
    // 1-0:4.8.0 = Cumulative hourly reactive export energy (R-) (Q3+Q4)
    if (strncmp(telegram, "1-0:4.8.0", 9) == 0)
    {
        currentMsg.RETURNDELIVERY_REACT = getValue(telegram, len, '(', '*');
        addJson("returndelivery_reactive", currentMsg.RETURNDELIVERY_REACT);
    }

    // 1-0:1.7.0(00.424*kW)
    // 1-0:1.7.x = Momentary Active power+ (Q1+Q4)
    if (strncmp(telegram, "1-0:1.7.0", 9) == 0)
    {
        currentMsg.ACTUAL_CONSUMPTION = getValue(telegram, len, '(', '*');
        addJson("actual_consumption", currentMsg.ACTUAL_CONSUMPTION);
    }

    // 1-0:2.7.0(00.000*kW) 
    // 1-0:2.7.x = Momentary Active power- (Q2+Q3)
    if (strncmp(telegram, "1-0:2.7.0", 9) == 0)
    {
        currentMsg.ACTUAL_RETURNDELIVERY = getValue(telegram, len, '(', '*');
        addJson("actual_returndelivery", currentMsg.ACTUAL_RETURNDELIVERY);
    }

    // 1-0:3.7.0(00.424*kW)
    // 1-0:3.7.x = Momentary Reactive power + ( Q1+Q2)
    if (strncmp(telegram, "1-0:3.7.0", 9) == 0)
    {
        currentMsg.ACTUAL_CONSUMPTION_REACT = getValue(telegram, len, '(', '*');
        addJson("actual_consumption_reactive", currentMsg.ACTUAL_CONSUMPTION_REACT);
    }

    // 1-0:4.7.0(00.000*kW) 
    // 1-0:4.7.x = Momentary Reactive power - ( Q3+Q4)
    if (strncmp(telegram, "1-0:4.7.0", 9) == 0)
    {
        currentMsg.ACTUAL_RETURNDELIVERY_REACT = getValue(telegram, len, '(', '*');
        addJson("actual_returndelivery_reactive", currentMsg.ACTUAL_RETURNDELIVERY_REACT);
    }

