skortela/esp8266_p1meter_sv/src/main.cpp
    // 1-0:21.7.0(00.378*kW)
    // 1-0:21.7.0 = Momentary Active power+ (L1)
    if (strncmp(telegram, "1-0:21.7.0", 10) == 0)
    {
        currentMsg.L1_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_usage", currentMsg.L1_INSTANT_POWER_USAGE);
    }

    // 1-0:22.7.0(00.378*kW)
    // 1-0:22.7.0 = Momentary Active power- (L1)
    if (strncmp(telegram, "1-0:22.7.0", 10) == 0)
    {
        currentMsg.L1_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_delivery", currentMsg.L1_INSTANT_POWER_DELIVERY);
    }

    // 1-0:41.7.0(00.378*kW)
    // 1-0:41.7.0 = Momentary Active power+ (L2)
    if (strncmp(telegram, "1-0:41.7.0", 10) == 0)
    {
        currentMsg.L2_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_usage", currentMsg.L2_INSTANT_POWER_USAGE);
    }

    // 1-0:42.7.0(00.378*kW)
    // 1-0:42.7.0 = Momentary Active power- (L2)
    if (strncmp(telegram, "1-0:42.7.0", 10) == 0)
    {
        currentMsg.L2_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_delivery", currentMsg.L2_INSTANT_POWER_DELIVERY);
    }

    // 1-0:61.7.0(00.378*kW)
    // 1-0:61.7.0 = Momentary Active power+ (L3)
    if (strncmp(telegram, "1-0:61.7.0", 10) == 0)
    {
        currentMsg.L3_INSTANT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_usage", currentMsg.L3_INSTANT_POWER_USAGE);
    }

    // 1-0:62.7.0(00.378*kW)
    // 1-0:62.7.0 = Momentary Active power- (L3)
    if (strncmp(telegram, "1-0:62.7.0", 10) == 0)
    {
        currentMsg.L3_INSTANT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_delivery", currentMsg.L3_INSTANT_POWER_DELIVERY);
    }

    // 1-0:23.7.0(00.378*kW)
    // 1-0:23.7.0 = Momentary Reactive power+ (L1)
    if (strncmp(telegram, "1-0:23.7.0", 10) == 0)
    {
        currentMsg.L1_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l1_reactive_power_usage", currentMsg.L1_REACT_POWER_USAGE);
    }

    // 1-0:24.7.0(00.378*kW)
    // 1-0:24.7.0 = Momentary Reactive power- (L1)
    if (strncmp(telegram, "1-0:24.7.0", 10) == 0)
    {
        currentMsg.L1_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l1_reactive_power_delivery", currentMsg.L1_REACT_POWER_DELIVERY);
    }

    // 1-0:43.7.0(00.378*kW)
    // 1-0:43.7.0 = Momentary Reactive power+ (L2)
    if (strncmp(telegram, "1-0:43.7.0", 10) == 0)
    {
        currentMsg.L2_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l2_reactive_power_usage", currentMsg.L2_REACT_POWER_USAGE);
    }

    // 1-0:44.7.0(00.378*kW)
    // 1-0:44.7.0 = Momentary Reactive power+ (L2)
    if (strncmp(telegram, "1-0:44.7.0", 10) == 0)
    {
        currentMsg.L2_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l2_reactive_power_delivery", currentMsg.L2_REACT_POWER_DELIVERY);
    }

    // 1-0:63.7.0(00.378*kW)
    // 1-0:63.7.0 = Momentary Reactive power+ (L3)
    if (strncmp(telegram, "1-0:63.7.0", 10) == 0)
    {
        currentMsg.L3_REACT_POWER_USAGE = getValue(telegram, len, '(', '*');
        addJson("l3_reactive_power_usage", currentMsg.L3_REACT_POWER_USAGE);
    }

    // 1-0:64.7.0(00.378*kW)
    // 1-0:64.7.0 = Momentary Reactive power- (L3)
    if (strncmp(telegram, "1-0:64.7.0", 10) == 0)
    {
        currentMsg.L3_REACT_POWER_DELIVERY = getValue(telegram, len, '(', '*');
        addJson("l3_reactive_power_delivery", currentMsg.L3_REACT_POWER_DELIVERY);
    }

    // 1-0:31.7.0(002*A)
    // 1-0:31.7.0 = Momentary RMS Current phase L1
    if (strncmp(telegram, "1-0:31.7.0", 10) == 0)
    {
        currentMsg.L1_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l1_instant_power_current", currentMsg.L1_INSTANT_POWER_CURRENT);
    }
    // 1-0:51.7.0(002*A)
    // 1-0:51.7.0 = Momentary RMS Current phase L2
    if (strncmp(telegram, "1-0:51.7.0", 10) == 0)
    {
        currentMsg.L2_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l2_instant_power_current", currentMsg.L2_INSTANT_POWER_CURRENT);
    }
    
    // 1-0:71.7.0(002*A)
    // 1-0:71.7.0 = Momentary RMS Current phase L3
    if (strncmp(telegram, "1-0:71.7.0", 10) == 0)
    {
        currentMsg.L3_INSTANT_POWER_CURRENT = getValue(telegram, len, '(', '*');
        addJson("l3_instant_power_current", currentMsg.L3_INSTANT_POWER_CURRENT);
    }

    // 1-0:32.7.0(232.0*V)
    // 1-0:32.7.0 = Momentary RMS Phase voltage L1
    if (strncmp(telegram, "1-0:32.7.0", 10) == 0)
    {
        currentMsg.L1_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l1_voltage", currentMsg.L1_VOLTAGE);
    }
    // 1-0:52.7.0(232.0*V)
    // 1-0:52.7.0 = Momentary RMS Phase voltage L2
    if (strncmp(telegram, "1-0:52.7.0", 10) == 0)
    {
        currentMsg.L2_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l2_voltage", currentMsg.L2_VOLTAGE);
    }   
    // 1-0:72.7.0(232.0*V)
    // 1-0:72.7.0 = Momentary RMS Phase voltage L3
    if (strncmp(telegram, "1-0:72.7.0", 10) == 0)
    {
        currentMsg.L3_VOLTAGE = getValue(telegram, len, '(', '*');
        addJson("l3_voltage",currentMsg. L3_VOLTAGE);
    }

    return validCRCFound;
}

void read_p1_hardwareserial()
{
    if (Serial.available())
    {
        memset(telegram, 0, sizeof(telegram));

        while (Serial.available())
        {
            ESP.wdtDisable();
            int len = Serial.readBytesUntil('\n', telegram, P1_MAXLINELENGTH);
            ESP.wdtEnable(1);

            if (len > 0) {
                processLine(len);
            }
        }
    }
    else {
        // send RSSI also even if no telegram messages seen
        if ((LAST_UPDATE_SENT == 0 && millis() > 15000) || (unsigned long)(millis() - (LAST_UPDATE_SENT)) > (UPDATE_INTERVAL+15000)) {
            send_metric("RSSI", WiFi.RSSI());
            LAST_UPDATE_SENT = millis();
        }
    }
}

void processLine(int len) {
    telegram[len] = '\n';
    telegram[len + 1] = 0;
    yield();

    bool result = decode_telegram(len + 1);
    if (result) {
        send_data_to_broker();
    }
}

// **********************************
// * EEPROM helpers                 *
// **********************************

String read_eeprom(int offset, int len)
{
    Serial.print(F("read_eeprom()"));

