skortela/esp8266_p1meter_sv/src/main.cpp
    // * Startup MDNS Service
    setup_mdns();

    // * Setup MQTT
    Serial.printf("MQTT connecting to: %s:%s\n", MQTT_HOST, MQTT_PORT);

#ifdef SEND_AS_JSON
    // increase default max size
    mqtt_client.setBufferSize(P1_MAXJSONLENGTH);
#endif
    mqtt_client.setServer(MQTT_HOST, atoi(MQTT_PORT));

}

void checkResetButton()
{
#ifdef KResetPin
    if (digitalRead(KResetPin) == LOW)
    {
        Serial.println("reset pressed");
        delay(50);
        unsigned long starttime = millis();
        while (digitalRead(KResetPin) == LOW)
        {
            delay(50);
            if ((unsigned long)(millis() - starttime) > 5000)
            {
                // 5 sec pressed, do reset settings and reboot
                Serial.println("Reset settings");
                Serial.flush();
                resetConfig();
                WiFiManager wifiManager;
                wifiManager.resetSettings();
                //turn off led
                digitalWrite(LED_BUILTIN, HIGH); // active LOW
                delay(2000);
                // turn on led
                digitalWrite(LED_BUILTIN, LOW);
                delay(100);
                wifiManager.reboot();
            }
        }
        Serial.println("reset aborted");
    }
#endif
}

// **********************************
// * Loop                           *
// **********************************

void loop()
{
    checkResetButton();
    ArduinoOTA.handle();
    long now = millis();

    if (!mqtt_client.connected())
    {
        if (now - LAST_RECONNECT_ATTEMPT > 5000)
        {
            LAST_RECONNECT_ATTEMPT = now;

            if (mqtt_reconnect())
            {
                LAST_RECONNECT_ATTEMPT = 0;
                LAST_UPDATE_SENT = 0;
            }
        }
    }
    else
    {
        mqtt_client.loop();
        read_p1_hardwareserial();
    }
}
